"espk" = "Apple 揚聲器埠";
"ispk" = "內建";
"emic" = "麥克風埠";
"imic" = "內建";
"hdpn" = "耳機埠";
"lini" = "音訊 line in 埠";
"lino" = "音訊 line out 埠";
"spdi" = "數位光纖輸入埠";
"spdo" = "數位光纖輸出埠";
"pci " = "PCI 卡";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "網路裝置";
"blue" = "藍牙";
"bluh" = "藍牙耳機";
"blus" = "藍牙耳麥";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
